load.yaml
execution:
- executor: pbench
  concurrency: 10
  hold-for: 10m
  ramp-up: 2m
  #iterations: 100
  throughput: 10
  scenario:
    requests:
      - url: https://example.com/
        label: pbench

reporting:
  - module: newrelic

modules:
    console:
      disable: true
      screen: console

    newrelic:
      dashboard-url: https://onenr.io/PLACEHOLDER
      project: my_project
      browser-open: none  # auto-open the report in browser, 
                            # can be "start", "end", "both", "none"
      send-interval: 5s   # send data each n-th second
      # token-file: token.txt
      # custom-tags:
      #   example: '1'